In [6]:
import pandas as pd
from operator import add
from functools import reduce
codeing={'subject':['python','java'],'amount':[1000,2000]}
df=pd.DataFrame(codeing)
print(df)

  subject  amount
0  python    1000
1    java    2000

In [7]:
df['amount']=df['amount'].map(lambda x:x*2)
print(df)

  subject  amount
0  python    2000
1    java    4000

In [11]:
df2=df.filter(items=['subject'])
print(df2)
reduce(add,df.amount)

  subject
0  python
1    java

6000

In [12]:
df2=df.filter(items=['subject'])
print(df2)

  subject
0  python
1    java

In [18]:
import pandas as pd
df=pd.DataFrame([[9,4,8,9],
                [8,10,7,6],
                [7,6,8,5]])
columns=['maths','english','science','history']
print(df)
df.agg(['sum','min','max','mean','median','std','count','size'])

   0   1  2  3
0  9   4  8  9
1  8  10  7  6
2  7   6  8  5

           0          1          2          3
sum     24.0  20.000000  23.000000  20.000000
min      7.0   4.000000   7.000000   5.000000
max      9.0  10.000000   8.000000   9.000000
mean     8.0   6.666667   7.666667   6.666667
median   8.0   6.000000   8.000000   6.000000
std      1.0   3.055050   0.577350   2.081666
count    3.0   3.000000   3.000000   3.000000
size     3.0   3.000000   3.000000   3.000000

In [20]:
import pandas as pd
technologies={
    'cources':["python","dbms","java","python","spark"],
    'fee':[20000,25000,26000,22000,24000],
    'duration':['30days','40days','35days','60days','30days'],
    'discount':[1000,2500,1200,2500,2200]}
df=pd.DataFrame(technologies)
print(df)

  cources    fee duration  discount
0  python  20000   30days      1000
1    dbms  25000   40days      2500
2    java  26000   35days      1200
3  python  22000   60days      2500
4   spark  24000   30days      2200

In [23]:
df.groupby('cources').aggregate({'fee':'count'})

         fee
cources
dbms       1
java       1
python     2
spark      1

In [27]:
df.groupby('cources').agg({'duration':'count','fee':['first','last']})

        duration    fee
           count  first   last
cources
dbms           1  25000  25000
java           1  26000  26000
python         2  20000  22000
spark          1  24000  24000